# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Always state the H0 and H1 before conducting the hypothesis test.
- Happy learning!

In [1]:
# import numpy and pandas

import pandas as pd
import numpy as np

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [7]:
df = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')

display(df.head())
display(df.shape)
display(df.info())

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

(33702, 8)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33702 entries, 0 to 33701
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33702 non-null  object
 1   Job Titles         33702 non-null  object
 2   Department         33702 non-null  object
 3   Full or Part-Time  33702 non-null  object
 4   Salary or Hourly   33702 non-null  object
 5   Typical Hours      8174 non-null   float64
 6   Annual Salary      25528 non-null  float64
 7   Hourly Rate        8174 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.1+ MB

None

Examine the `salaries` dataset using the `head` function below.

In [4]:
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ADRIANO, RACQUEL ANNE",PARAMEDIC,FIRE,F,Salary,NaN,72510.0,NaN
1,"AFFANEH, MAHIR A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.0
3,"AGAR, BULENT B",DEPUTY COMMISSIONER,WATER MGMNT,F,Salary,NaN,132972.0,NaN
4,"AGEE, LAWRENCE",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [5]:
df.isna().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25528
Annual Salary         8174
Hourly Rate          25528
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [11]:
# Code 1:

df['Salary or Hourly'].value_counts()

Salary    25528
Hourly     8174
Name: Salary or Hourly, dtype: int64

In [16]:
# Code 2:

df.pivot_table(index=['Salary or Hourly'],values= 'Name', aggfunc=['count']).rename(columns={'Name':''}).reset_index()

  Salary or Hourly  count

0           Hourly   8174
1           Salary  25528

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [17]:
# Code 1:

df['Department'].value_counts()

POLICE                 13848
FIRE                    4627
STREETS & SAN           2175
WATER MGMNT             1914
AVIATION                1856
OEMC                    1737
TRANSPORTN              1113
PUBLIC LIBRARY          1088
DAIS                    1033
FAMILY & SUPPORT         656
FINANCE                  544
HEALTH                   467
LAW                      398
CITY COUNCIL             362
BUILDINGS                258
PUBLIC SAFETY ADMIN      244
BUSINESS AFFAIRS         167
HOUSING & ECON DEV       154
COPA                     123
BOARD OF ELECTION        111
MAYOR'S OFFICE           104
INSPECTOR GEN             95
CITY CLERK                88
PROCUREMENT               84
HUMAN RESOURCES           75
ANIMAL CONTRL             75
CULTURAL AFFAIRS          74
HOUSING                   66
BUDGET & MGMT             44
ADMIN HEARNG              38
DISABILITIES              28
TREASURER                 28
HUMAN RELATIONS           17
BOARD OF ETHICS            8
POLICE BOARD               2
LICENSE APPL COMM          1
Name: Department, dtype: int64

In [22]:
# Code 2:

df.pivot_table(index=['Department'], values='Name', aggfunc=['count']).rename(columns={'Name':''}).sort_values(by='count', ascending=False).reset_index()

             Department  count

0                POLICE  13848
1                  FIRE   4627
2         STREETS & SAN   2175
3           WATER MGMNT   1914
4              AVIATION   1856
5                  OEMC   1737
6            TRANSPORTN   1113
7        PUBLIC LIBRARY   1088
8                  DAIS   1033
9      FAMILY & SUPPORT    656
10              FINANCE    544
11               HEALTH    467
12                  LAW    398
13         CITY COUNCIL    362
14            BUILDINGS    258
15  PUBLIC SAFETY ADMIN    244
16     BUSINESS AFFAIRS    167
17   HOUSING & ECON DEV    154
18                 COPA    123
19    BOARD OF ELECTION    111
20       MAYOR'S OFFICE    104
21        INSPECTOR GEN     95
22           CITY CLERK     88
23          PROCUREMENT     84
24        ANIMAL CONTRL     75
25      HUMAN RESOURCES     75
26     CULTURAL AFFAIRS     74
27              HOUSING     66
28        BUDGET & MGMT     44
29         ADMIN HEARNG     38
30         DISABILITIES     28
31            TREASURER     28
32      HUMAN RELATIONS     17
33      BOARD OF ETHICS      8
34         POLICE BOARD      2
35    LICENSE APPL COMM      1

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [23]:
from scipy.stats import ttest_1samp

In [70]:
hourly_wage = df[df['Salary or Hourly'] == 'Hourly']['Hourly Rate']

hourly_wage = pd.DataFrame(hourly_wage)

hourly_wage.head()

    Hourly Rate
2         13.00
5         37.45
15        40.78
16        38.52
21        34.98

In [65]:
# H0: the hourly wage of all hourly workers is = $30/hr
# H1: the hourly wage of all hourly workers is <> $30/hr

confidence_level = 0.95
alpha = 0.05

stat, pval = ttest_1samp(hourly_wage, 30)

print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval)

stat is   [31.21150033]
pvalue for the two-tailed test is  [3.82547585e-202]

In [66]:
# Comments:

# p-value is very close to zero, less than alpla = 0.05, suggesting strong evidence against 
# the null hypothesis that the hourly wages are equal to $30/hr. 

# This indicates that the hourly wages are significantly different from the hypothesized mean of $30/hr 
# in both directions (less than and greater than $30/hr).

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our Null hypothesis is less than or equal to, then to reject, the test statistic must be positive (rejects the <) and the p-value below 0.05 (rejects the =).

In [76]:
Police_salary = df[(df['Salary or Hourly'] == 'Salary') & (df['Department'] == 'POLICE')]['Annual Salary']

Police_salary = pd.DataFrame(PF_salary)

Police_salary.head()

   Annual Salary
0        72510.0
1        93354.0
3       132972.0
4        90024.0
6       111444.0

In [77]:
# H0: salaries this year are <= than last year's mean of $86000/year
# H1: salaries this year are > than last year's mean of $86000/year

stat, pval = ttest_1samp(Police_salary, 86000)
print('stat is  ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat is   [23.14957659]
pvalue for the one-tailed test is  [1.18825704e-117]

In [ ]:
# Comments:

# p-value is much smaller than 0.05, therefore we reject H0. 

# There is strong evidence to suggest that the average salary of police employees this year is 
# significantly higher than $86,000/year.

Using the `crosstab` function, find the department that has the most hourly workers.

In [79]:
hourly_workers = df[df['Salary or Hourly'] == 'Hourly']
hourly_workers.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
2,"AFOENYI, PHYLLIS",TITLE V PROGRAM TRAINEE I,FAMILY & SUPPORT,P,Hourly,20.0,NaN,13.00
5,"AGNEW, ANTONIO E",MOTOR TRUCK DRIVER,AVIATION,F,Hourly,40.0,NaN,37.45
15,"AGSALUD, FERNAN S",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,40.78
16,"AGSALUD JR, JUANITO S",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,38.52
21,"AGUAYO, LUIS M",LABORER - APPRENTICE,WATER MGMNT,F,Hourly,40.0,NaN,34.98

In [94]:
df_crosstab = pd.crosstab(hourly_workers['Department'], hourly_workers['Salary or Hourly'], margins=False).rename(columns={'Hourly':'Hourly workers'}).sort_values(by='Hourly workers', ascending=False)

display(df_crosstab.head())

most_hourly_department = df_crosstab['Hourly workers'].idxmax()

max_hourly_department_count = df_crosstab['Hourly workers'].max()

print("Department with the most hourly workers:","  ", most_hourly_department, '  :  ', max_hourly_department_count)

Salary or Hourly  Hourly workers
Department
STREETS & SAN               1846
WATER MGMNT                 1558
AVIATION                    1214
OEMC                        1077
DAIS                         745

Department with the most hourly workers:    STREETS & SAN   :   1846

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [99]:
# H0: hourly wage is >=  $35/hour
# H1: hourly wage is <  $35/hour

streets_san_salary = df[(df['Department']== 'STREETS & SAN') & (df['Salary or Hourly'] == 'Hourly')]['Hourly Rate']

streets_san_salary = pd.DataFrame(streets_san_salary).rename(columns={'Hourly Rate':'Hourly Rate Streets&San'})

streets_san_salary

       Hourly Rate Streets&San
15                       40.78
16                       38.52
26                       38.52
49                       29.96
65                       37.45
...                        ...
33623                    38.01
33624                    37.45
33667                    37.45
33668                    38.52
33676                    25.95

[1846 rows x 1 columns]

In [100]:
stat, pval = ttest_1samp(streets_san_salary, 35)
print('stat is  ', stat)
print('pvalue for the one-tailed test is ', pval/2)

stat is   [4.0001388]
pvalue for the one-tailed test is  [3.29023722e-05]

In [ ]:
# Comments:

# p-value is less than 0.05, therefore we reject H0. 

# There is strong evidence to suggest that the hourly wage of workers in the department STREETS & SAN
# is significantly less than $35/hour. 

# The results support the workers' complaint.

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [104]:
import scipy.stats

hourly_wage = df[df['Salary or Hourly'] == 'Hourly']['Hourly Rate']

confidence_level = 0.95

degrees_freedom = len(hourly_wage) - 1 

sample_mean = np.mean(hourly_wage)

sample_standard_error = scipy.stats.sem(hourly_wage) 

confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

display(sample_standard_error)

print( 'confidence interval is ', confidence_interval, '.' )

0.14694742867989574

confidence interval is  (34.29839539204317, 34.874504045196865) .

In [ ]:
# Comments:

# The interval suggests that we can be 95% confident that the true population mean hourly wage falls 
# within the range of $34.30/hour to $34.87/hour.

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [105]:
Police_salary = df[(df['Salary or Hourly'] == 'Salary') & (df['Department'] == 'POLICE')]['Annual Salary']

confidence_level = 0.95

degrees_freedom = len(Police_salary) - 1 

sample_mean = np.mean(Police_salary)

sample_standard_error = scipy.stats.sem(Police_salary) 

confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)

display(sample_standard_error)

print( 'confidence interval is ', confidence_interval, '.' )

153.0509585263483

confidence interval is  (88534.1182885883, 89134.11955863392) .

In [ ]:
# Comments:

# The interval suggests that we can be 95% confident that the true population mean hourly wage falls 
# within the range of $88,534.12/year to $89,134.12/year for salaried employees in the police department.

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [ ]:
# H0: number hourly workers = 25% at the 95% confidence level
# H1: number hourly workers <> 25% at the 95% confidence level

In [107]:
import statsmodels.api as sm

hourly_workers = df[df['Salary or Hourly'] == 'Hourly']

total_workers = len(df)

num_hourly_workers = len(hourly_workers)

null_hypothesis_proportion = 0.25


z_stat, p_value = sm.stats.proportions_ztest(num_hourly_workers, total_workers, null_hypothesis_proportion)

print("Z_stat:", z_stat)
print("P_value:", p_value)

Z_stat: -3.1962453870335
P_value: 0.0013922864704323116

In [ ]:
# Comments:

# pvalue is less than 0.05, therefore we reject H0. 

# This suggests that the proportion of hourly workers is different from 25% at the 95% confidence level. 

# In this case, the negative zstatistic indicates that the proportion of hourly workers is lower than 25%.